# BuiltInFailures.GridFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridFailures Class
BuiltInFailures Class Members See Also
---
Failures about Grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class GridFailures
```

Visual Basic
---
```text
Public NotInheritable Class GridFailures
```

Visual C++
---
```text
public ref class GridFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..GridFailures
# See Also
BuiltInFailures..::..GridFailures Members
Autodesk.Revit.DB Namespace